In [1]:
import pandas as pd
import numpy as np

In [2]:
employee=pd.DataFrame({'empId':[3,1,2,4],
                       'name':['Brad','John','Dan','Thomas'],
                       'supervisor':[np.nan,3,3,3],
                       'salary':[4000,1000,2000,4000]})
employee

   empId    name  supervisor  salary
0      3    Brad         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [3]:
bonus=pd.DataFrame({'empId':[2,4],
                    'bonus':[500,2000]})
bonus

   empId  bonus
0      2    500
1      4   2000

In [4]:
data=pd.merge(employee,bonus,on=['empId'],how='left')
data

   empId    name  supervisor  salary   bonus
0      3    Brad         NaN    4000     NaN
1      1    John         3.0    1000     NaN
2      2     Dan         3.0    2000   500.0
3      4  Thomas         3.0    4000  2000.0

In [5]:
output=data.loc[(data['bonus']<1000) | (data['bonus'].isnull()) ,['name','bonus']]
output

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0